{"config": [{"config": {"dtype": "float32", "mask_zero": false, "embeddings_regularizer": null, "output_dim": 32, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "trainable": true, "input_dim": 86, "batch_input_shape": [null, 1024], "embeddings_constraint": null, "activity_regularizer": null, "input_length": 1024, "name": "embedding_8"}, "class_name": "Embedding"}, {"config": {"return_sequences": true, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "dropout": 0.2, "name": "lstm_8", "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "use_bias": true, "return_state": false, "unroll": false, "recurrent_constraint": null, "stateful": false, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "kernel_regularizer": null, "implementation": 1, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_dropout": 0.2, "units": 64}, "class_name": "LSTM"}, {"config": {"return_sequences": false, "trainable": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "dropout": 0.0, "name": "lstm_9", "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "use_bias": true, "return_state": false, "unroll": false, "recurrent_constraint": null, "stateful": false, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unit_forget_bias": true, "kernel_regularizer": null, "implementation": 1, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_constraint": null, "recurrent_dropout": 0.0, "units": 64}, "class_name": "LSTM"}, {"config": {"noise_shape": null, "name": "dropout_15", "trainable": true, "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "name": "dense_8", "trainable": true, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "units": 1}, "class_name": "Dense"}], "keras_version": "2.1.5", "class_name": "Sequential", "backend": "tensorflow"}